Tekla Open API Reference for Tekla Structures 2025
Mesh.Triangles Property
 An array list of indices (as integers) pointing to the points array list. Three consecutive indices always represent a single triangle.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Triangles { get; }
Public ReadOnly Property Triangles As ArrayList
	Get
Property Value
Type: ArrayList
See Also
Reference
Mesh Class
Tekla.Structures.Model.UI Namespace